"""

1.Логика общения с пользователем
1.1 СОЗДАНИЕ создать объект ручной работы
1.1.1 название проекта ручной работы
1.1.2 список материалов (while True)
1.1.3 сохранение в базу данных


1.2  ПОДСЧЕТ логика подсчета стоимости
1.2.1 выбрать объект ручной работы
1.2.2 колличество объектов
1.2.3 вывод результата подсчета
1.3  УДАЛЕНИЕ удаление объекта ручной работы
1.3.1 вывести список объектов ручной работы из базы данных
1.3.2 удалить объект из базы данных
1.4 РЕДАКТИРОВАНИЕ
1.4.1 вывести список объектов(свечка) ручной работы из базы данных
1.4.2 вывести список материалов ручной работы из базы данных
1.4.3 предложить удалить или редактировать  материал
1.4.3.1 еслт удалить, тогда удаляем материал из объекта в базе данных
1.4.3.2 если редактировать ,то предложить список параметров матери ала(имя,колличество,ссылку на товар)



2.База данных
2.1 объект ручной работы
2.2 материал для объекта (состав)
2.2.1 имя материала
2.2.2 необходимое количество для создания объекта
2.2.3 ссылка на магазин
3.Телеграм Бот

4.Парсер




"""